zerokelvin-lab/Watch/Software/Watch_pro_1.0/Core/Inc/stm32f4xx_hal_conf.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    stm32f4xx_hal_conf.h
  * @brief   STM32F4 HAL库配置文件——选择使能的外设模块、时钟源参数、系统配置
  *         本项目启用的模块：ADC、RTC、SPI、TIM、UART、GPIO、EXTI、DMA、RCC、FLASH、PWR、CORTEX
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F4xx_HAL_CONF_H
#define __STM32F4xx_HAL_CONF_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

/* ########################## Module Selection ############################## */
/**
  * @brief HAL库模块选择——定义需要启用的外设驱动模块
  *        注释掉的模块不参与编译，可减小固件体积
  */
// HAL总模块使能（必须启用）
#define HAL_MODULE_ENABLED

  // ====== 启用的外设模块 ======
  #define HAL_ADC_MODULE_ENABLED       // ADC模数转换模块（电池电压采集）
/* #define HAL_CRYP_MODULE_ENABLED   */
/* #define HAL_CAN_MODULE_ENABLED   */
/* #define HAL_CRC_MODULE_ENABLED   */
/* #define HAL_CAN_LEGACY_MODULE_ENABLED   */
/* #define HAL_CRYP_MODULE_ENABLED   */
/* #define HAL_DAC_MODULE_ENABLED   */
/* #define HAL_DCMI_MODULE_ENABLED   */
/* #define HAL_DMA2D_MODULE_ENABLED   */
/* #define HAL_ETH_MODULE_ENABLED   */
/* #define HAL_NAND_MODULE_ENABLED   */
/* #define HAL_NOR_MODULE_ENABLED   */
/* #define HAL_PCCARD_MODULE_ENABLED   */
/* #define HAL_SRAM_MODULE_ENABLED   */
/* #define HAL_SDRAM_MODULE_ENABLED   */
/* #define HAL_HASH_MODULE_ENABLED   */
/* #define HAL_I2C_MODULE_ENABLED   */
/* #define HAL_I2S_MODULE_ENABLED   */
/* #define HAL_IWDG_MODULE_ENABLED   */
/* #define HAL_LTDC_MODULE_ENABLED   */
/* #define HAL_RNG_MODULE_ENABLED   */
  #define HAL_RTC_MODULE_ENABLED       // RTC实时时钟模块
/* #define HAL_SAI_MODULE_ENABLED   */
/* #define HAL_SD_MODULE_ENABLED   */
/* #define HAL_MMC_MODULE_ENABLED   */
  #define HAL_SPI_MODULE_ENABLED       // SPI串行外设接口模块（显示屏驱动）
  #define HAL_TIM_MODULE_ENABLED       // TIM定时器模块（PWM背光 + HAL时基）
  #define HAL_UART_MODULE_ENABLED      // UART串口模块（调试输出 + 通信）
/* #define HAL_USART_MODULE_ENABLED   */
/* #define HAL_IRDA_MODULE_ENABLED   */
/* #define HAL_SMARTCARD_MODULE_ENABLED   */
/* #define HAL_SMBUS_MODULE_ENABLED   */
/* #define HAL_WWDG_MODULE_ENABLED   */
/* #define HAL_PCD_MODULE_ENABLED   */
/* #define HAL_HCD_MODULE_ENABLED   */
/* #define HAL_DSI_MODULE_ENABLED   */
/* #define HAL_QSPI_MODULE_ENABLED   */
/* #define HAL_QSPI_MODULE_ENABLED   */
/* #define HAL_CEC_MODULE_ENABLED   */
/* #define HAL_FMPI2C_MODULE_ENABLED   */
/* #define HAL_FMPSMBUS_MODULE_ENABLED   */
/* #define HAL_SPDIFRX_MODULE_ENABLED   */
/* #define HAL_DFSDM_MODULE_ENABLED   */
/* #define HAL_LPTIM_MODULE_ENABLED   */
  // ====== 核心基础模块（必须使能） ======
  #define HAL_GPIO_MODULE_ENABLED      // GPIO通用输入输出模块
  #define HAL_EXTI_MODULE_ENABLED      // EXTI外部中断模块（按键、充电、MPU中断）
  #define HAL_DMA_MODULE_ENABLED       // DMA直接存储器访问模块
  #define HAL_RCC_MODULE_ENABLED       // RCC复位与时钟控制模块
  #define HAL_FLASH_MODULE_ENABLED     // Flash闪存模块
  #define HAL_PWR_MODULE_ENABLED       // PWR电源控制模块
  #define HAL_CORTEX_MODULE_ENABLED    // Cortex-M4内核模块（NVIC/SysTick等）

/* ########################## HSE/HSI Values adaptation ##################### */
/**
  * @brief 外部高速振荡器/内部高速振荡器频率配置
  *        本项目使用HSI(16MHz)作为主时钟源，HSE(25MHz)未使用但保留默认值
  */
#if !defined  (HSE_VALUE)
  #define HSE_VALUE    25000000U /*!< 外部高速振荡器频率（Hz），默认25MHz */
#endif /* HSE_VALUE */

#if !defined  (HSE_STARTUP_TIMEOUT)
  #define HSE_STARTUP_TIMEOUT    100U   /*!< HSE启动超时时间（ms） */
#endif /* HSE_STARTUP_TIMEOUT */

/**
  * @brief Internal High Speed oscillator (HSI) value.
  *        This value is used by the RCC HAL module to compute the system frequency
  *        (when HSI is used as system clock source, directly or through the PLL).
  */
#if !defined  (HSI_VALUE)
  #define HSI_VALUE    ((uint32_t)16000000U) /*!< 内部高速振荡器频率（Hz），16MHz */
#endif /* HSI_VALUE */

/**
  * @brief Internal Low Speed oscillator (LSI) value.
  */
#if !defined  (LSI_VALUE)
 #define LSI_VALUE  32000U       /*!< 内部低速振荡器典型值（Hz），约32kHz */
#endif /* LSI_VALUE */                      /*!< 实际值受电压和温度影响 */
/**
  * @brief External Low Speed oscillator (LSE) value.
  */
#if !defined  (LSE_VALUE)
 #define LSE_VALUE  32768U    /*!< 外部低速振荡器频率（Hz），32.768kHz（用于RTC） */
#endif /* LSE_VALUE */

#if !defined  (LSE_STARTUP_TIMEOUT)
  #define LSE_STARTUP_TIMEOUT    5000U   /*!< LSE启动超时时间（ms） */
#endif /* LSE_STARTUP_TIMEOUT */

/**
  * @brief External clock source for I2S peripheral
  *        This value is used by the I2S HAL module to compute the I2S clock source
  *        frequency, this source is inserted directly through I2S_CKIN pad.
  */
#if !defined  (EXTERNAL_CLOCK_VALUE)
  #define EXTERNAL_CLOCK_VALUE    12288000U /*!< 外部音频时钟频率（Hz） */
#endif /* EXTERNAL_CLOCK_VALUE */

/* ########################### System Configuration ######################### */
/**
  * @brief HAL系统配置——内核电压、滴答优先级、RTOS开关、缓存使能
  */
// 系统电压配置
#define  VDD_VALUE		      3300U        /*!< VDD供电电压（mV），3.3V */
#define  TICK_INT_PRIORITY            15U   /*!< 滴答中断优先级（最低），TIM1替代SysTick后此值仍保留 */
#define  USE_RTOS                     0U    /*!< RTOS使用标志（0 = 未使用RTOS时基，实际使用FreeRTOS） */
#define  PREFETCH_ENABLE              1U    /*!< 使能Flash预取 */  
#define  INSTRUCTION_CACHE_ENABLE     1U    /*!< 使能指令缓存 */
#define  DATA_CACHE_ENABLE            1U    /*!< 使能数据缓存 */

// 外设回调函数注册功能统一禁用（减小代码体积，使用默认弱回调）
#define  USE_HAL_ADC_REGISTER_CALLBACKS         0U /* ADC回调注册禁用 */
#define  USE_HAL_CAN_REGISTER_CALLBACKS         0U /* CAN回调注册禁用 */
#define  USE_HAL_CEC_REGISTER_CALLBACKS         0U /* CEC回调注册禁用 */
#define  USE_HAL_CRYP_REGISTER_CALLBACKS        0U /* CRYP回调注册禁用 */
#define  USE_HAL_DAC_REGISTER_CALLBACKS         0U /* DAC回调注册禁用 */
#define  USE_HAL_DCMI_REGISTER_CALLBACKS        0U /* DCMI回调注册禁用 */
#define  USE_HAL_DFSDM_REGISTER_CALLBACKS       0U /* DFSDM回调注册禁用 */
#define  USE_HAL_DMA2D_REGISTER_CALLBACKS       0U /* DMA2D回调注册禁用 */
#define  USE_HAL_DSI_REGISTER_CALLBACKS         0U /* DSI回调注册禁用 */
#define  USE_HAL_ETH_REGISTER_CALLBACKS         0U /* ETH回调注册禁用 */
#define  USE_HAL_HASH_REGISTER_CALLBACKS        0U /* HASH回调注册禁用 */
#define  USE_HAL_HCD_REGISTER_CALLBACKS         0U /* HCD回调注册禁用 */
#define  USE_HAL_I2C_REGISTER_CALLBACKS         0U /* I2C回调注册禁用 */
#define  USE_HAL_FMPI2C_REGISTER_CALLBACKS      0U /* FMPI2C回调注册禁用 */
#define  USE_HAL_FMPSMBUS_REGISTER_CALLBACKS    0U /* FMPSMBUS回调注册禁用 */
#define  USE_HAL_I2S_REGISTER_CALLBACKS         0U /* I2S回调注册禁用 */
#define  USE_HAL_IRDA_REGISTER_CALLBACKS        0U /* IRDA回调注册禁用 */
#define  USE_HAL_LPTIM_REGISTER_CALLBACKS       0U /* LPTIM回调注册禁用 */
#define  USE_HAL_LTDC_REGISTER_CALLBACKS        0U /* LTDC回调注册禁用 */
#define  USE_HAL_MMC_REGISTER_CALLBACKS         0U /* MMC回调注册禁用 */
#define  USE_HAL_NAND_REGISTER_CALLBACKS        0U /* NAND回调注册禁用 */
#define  USE_HAL_NOR_REGISTER_CALLBACKS         0U /* NOR回调注册禁用 */
#define  USE_HAL_PCCARD_REGISTER_CALLBACKS      0U /* PCCARD回调注册禁用 */
#define  USE_HAL_PCD_REGISTER_CALLBACKS         0U /* PCD回调注册禁用 */
#define  USE_HAL_QSPI_REGISTER_CALLBACKS        0U /* QSPI回调注册禁用 */
#define  USE_HAL_RNG_REGISTER_CALLBACKS         0U /* RNG回调注册禁用 */
#define  USE_HAL_RTC_REGISTER_CALLBACKS         0U /* RTC回调注册禁用 */
#define  USE_HAL_SAI_REGISTER_CALLBACKS         0U /* SAI回调注册禁用 */
#define  USE_HAL_SD_REGISTER_CALLBACKS          0U /* SD回调注册禁用 */
#define  USE_HAL_SMARTCARD_REGISTER_CALLBACKS   0U /* SMARTCARD回调注册禁用 */
#define  USE_HAL_SDRAM_REGISTER_CALLBACKS       0U /* SDRAM回调注册禁用 */
#define  USE_HAL_SRAM_REGISTER_CALLBACKS        0U /* SRAM回调注册禁用 */
#define  USE_HAL_SPDIFRX_REGISTER_CALLBACKS     0U /* SPDIFRX回调注册禁用 */
#define  USE_HAL_SMBUS_REGISTER_CALLBACKS       0U /* SMBUS回调注册禁用 */
#define  USE_HAL_SPI_REGISTER_CALLBACKS         0U /* SPI回调注册禁用 */
#define  USE_HAL_TIM_REGISTER_CALLBACKS         0U /* TIM回调注册禁用 */
#define  USE_HAL_UART_REGISTER_CALLBACKS        0U /* UART回调注册禁用 */
#define  USE_HAL_USART_REGISTER_CALLBACKS       0U /* USART回调注册禁用 */
#define  USE_HAL_WWDG_REGISTER_CALLBACKS        0U /* WWDG回调注册禁用 */

